# GetPrintedViewElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentPrintedEventArgs..::..GetPrintedViewElementIds Method
DocumentPrintedEventArgs Class See Also
---
Returns ElementIds of the views that printed successfully.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public IList<ElementId> GetPrintedViewElementIds()
```

Visual Basic
---
```text
Public Function GetPrintedViewElementIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetPrintedViewElementIds()
```

# ### Return Value
ElementIds of the views that printed successfully.
# See Also
DocumentPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace